#include "../../main.h"

/*
2. Яблочная философия
Спросить количество яблок в корзине.
Если чётное, порадоваться, что всем досталось поровну.
Если не чётное, объявить поединок за последнее яблоко.
Если яблок не целое количество, сперва нужно извиниться и выкинуть огрызок.
А если отрицательное количество или ноль, отказаться от мелочных материальных забот и по-философствовать о вечном.
*/

// если не целое - "выкинуть огрызок"

// если чётное - "Ура, всем поровну"
// если не чётное - "Битва"
// если отрицательное или 0 - "философствуем"

void home2::task2() {  
    
}